<template>
  <div class="agreement">
    <h1>隐私政策</h1>

    <p>新天元微商城（简称“我们”）尊重并保护所有使用新天元微商城平台服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，我们会按照本隐私权政策的规定使用和披露您的个人信息。但我们将以高度的勤勉、审慎义务对待这些信息。在未征得您事先许可的情况下，我们不会将这些信息对外披露或向第三方提供。我们会不时更新本隐私权政策。您在同意本隐私政策之时，即视为您已经同意本隐私权政策全部内容。</p>

    <h2>1. 适用范围</h2>
    <p>a）在您注册可以登录新天元微商城的账户时，您提供的个人注册信息（应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息除外）；</p>
    <p>b）在您使用新天元微商城时，我们可能会读取与您位置和移动设备相关的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。</p>
    <p>c）我们通过合法途径从商业伙伴处取得的用户个人数据。</p>
    <p>您了解并同意，以下信息不适用本隐私权政策：</p>
    <p>a）您在使用新天元微商城提供的搜索服务时输入的关键字信息； </p>
    <p>b）信用评价、违反法律规定或违反新天元微商城规则行为及已对您采取的措施。 </p>

    <h2> 2. 信息使用</h2>
    <p> a）我们不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和我们单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。</p>
    <p> b）我们亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何用户如从事上述活动，一经发现，我们有权立即终止与该用户的服务协议。</p>
    <p>c）为服务用户的目的，我们或关联公司可能通过使用您的个人信息，向您提供您可能感兴趣的信息，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或者与合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。</p>
    <p> d）我们可以使用您的个人信息以预防、发现、调查欺诈、危害安全、非法或违反与新天元微商城或关联公司协议、政策或规则的行为，以保护您、其他用户，或新天元微商城或关联公司合法权益。</p>

    <h2> 3. 信息披露</h2>
    <p> 在如下情况下，我们将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：</p>
    <p> a）经您事先同意，向第三方披露；</p>
    <p> b）如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</p>
    <p> c）根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
    <p> d）如您出现违反中国有关法律、法规或者服务协议或相关规则的情况，需要向第三方披露；</p>
    <p> e）为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；</p>
    <p> f）在新天元微商城上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，我们有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。</p>
    <p> g）其它我们根据法律、法规或者网站政策认为合适的披露。</p>

    <h2> 4. 信息存储和交换</h2>
    <p> 我们收集的有关您的信息和资料将保存在新天元微商城及或关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区被访问、存储和展示。</p>

    <h2> 5. 信息安全</h2>
    <p>a）您的账户均有安全保护功能，请妥善保管您的账户及密码信息。我们将通过向其它服务器备份、对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在「完善的安全措施」。</p>
    <p>b）在使用新天元微商城服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是你的账户及密码发生泄露，请您立即联络新天元微商城客服，以便我们采取相应措施。</p>

    <h2> 6. 未成年人的特别注意事项</h2>
    <p> 如果您不是具备完全民事权利能力和完全民事行为能力的自然人，您无权使用新天元微商城服务，因此我们希望您不要向我们提供任何个人信息。</p>
  </div>
</template>

<script>
  export default {
    name: "agreement"
  }
</script>

<style lang="scss" scoped>
  .agreement {
    @function upx($size) {
      @return $size + upx;
    }
    padding: upx(20);

    h1, h2 {
      padding: upx(10) 0;
    }

    h1 {
      text-align: center;
      font-weight: bolder;
      font-size: upx(42);
    }

    h2 {
      text-align: left;
      font-weight: bolder;
      font-size: upx(42);
    }

    p {
      font-size: upx(28);
      padding: upx(10) 0;
    }
  }
</style>
